WMSGIFT/src/Documents/УстановкаГрафиковСотрудникам/УстановкаГрафиковСотрудникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаГрафиковСотрудникам</name>
  <registerRecords>InformationRegister.ГрафикРаботыСотрудников</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>График</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОграниченияДействияГрафика</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДанныеСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.итWMSРаботникиСклада</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

WMSGIFT/src/InformationRegisters/ГрафикРаботыСотрудников/ГрафикРаботыСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ГрафикРаботыСотрудников</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>УдалитьГрафикРаботыПоОкончании</name>
    <type>
      <types>CatalogRef.ГрафикиРаботыСотрудников</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.итWMSРаботникиСклада</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

WMSGIFT/src/Documents/УстановкаГрафиковСотрудникам/ObjectModule.bsl
#Если НаСервере тогда
	
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ГрафикРаботыСотрудников=Движения.ГрафикРаботыСотрудников;
	ГрафикРаботыСотрудников.Очистить();
	ГрафикРаботыСотрудников.Записать();
	ГрафикРаботыСотрудников.Записывать=Истина;
	Для Каждого стр Из ДанныеСотрудников Цикл
		НоваяСтрока=ГрафикРаботыСотрудников.Добавить();
		НоваяСтрока.ГоловнаяОрганизация=Организация;
		НоваяСтрока.ГрафикРаботы=График;
		НоваяСтрока.Период=Дата;
		НоваяСтрока.Сотрудник=стр.Сотрудник;
		НоваяСтрока.Регистратор=Ссылка;
		Если ДатаОграниченияДействияГрафика <> '00010101' Тогда
        НоваяСтрока.ДействуетДо=ДатаОграниченияДействияГрафика;			
		КонецЕсли;
	КонецЦикла;
	ГрафикРаботыСотрудников.Записать();
КонецПроцедуры

#КонецЕсли
